vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/INC/RT_Agent.c
/******************************************************************************/
/* RT_Agent.C: Real-Time Agent V2.12                                          */
/******************************************************************************/
/*                                                                            */                           
/******************************************************************************/
/* This file is part of the uVision/ARM development tools.                    */
/* Copyright (c) 2006-07 Keil - An ARM Company. All rights reserved.          */
/* This software may only be used under the terms of a valid, current,        */
/* end user licence from KEIL for a compatible version of KEIL software       */
/* development tools. Nothing else gives you the right to use this software.  */
/******************************************************************************/

#pragma thumb     /* Force thumb mode */
#pragma O3        /* Force optimisation level 3 */
#pragma Otime     /* Force optimisation for time */

/*==============================================================================
   DO NOT EDIT THIS FILE (unless using custom hardware)
==============================================================================*/

// Real-Time Agent Version
#define __RTA_VERSION_MAJ     2
#define __RTA_VERSION_MIN     12
#define __RTA_VERSION         (__RTA_VERSION_MAJ << 4) | __RTA_VERSION_MIN

/*==============================================================================
   Real-Time Agent Includes
==============================================================================*/

#include "RT_Agent.H"

/*==============================================================================
   Configuration defines check
==============================================================================*/

// <e0>Real-Time Agent
// <i>Enable Real-Time Agent to obtain run-time debug information.
#ifndef __RTA_ENABLED
 #error Real-Time Agent: __RTA_ENABLED not defined!
#endif

#ifndef __RTA_HW_TYPE
 #error Real-Time Agent: __RTA_HW_TYPE not defined!
#endif

#ifndef __RTA_OUT_SIZE_BYTES
 #error Real-Time Agent: __RTA_OUT_SIZE_BYTES not defined!
#endif

#ifndef __RTA_NO_MEM_FLAG
 #error Real-Time Agent: __RTA_NO_MEM_FLAG not defined!
#endif

#ifndef __RTA_TERM_SUPPORT
 #error Real-Time Agent: __RTA_TERM_SUPPORT not defined!
#endif

#ifndef __RTA_TERM_ECHO
 #error Real-Time Agent: __RTA_TERM_ECHO not defined!
#endif

#ifndef __RTA_TERM_W_BLOCKING
 #error Real-Time Agent: __RTA_TERM_W_BLOCKING not defined!
#endif

#ifndef __IO_RETARGET_ENABLED
 #error Real-Time Agent: __IO_RETARGET_ENABLED not defined!
#endif

#ifndef __IO_RETARGET_STDIO_ROUTE
 #error Real-Time Agent: __IO_RETARGET_STDIO_ROUTE not defined!
#endif

#ifndef __IO_RETARGET_FOPEN_ETC_ENABLED
 #error Real-Time Agent: __IO_RETARGET_FOPEN_ETC_ENABLED not defined!
#endif

#ifndef __RTA_DEC
 #error Real-Time Agent: __RTA_DEC not defined!
#endif

#ifndef __RTA_TERM_IN_SIZE
 #error Real-Time Agent: __RTA_TERM_IN_SIZE not defined!
#endif

#ifndef RTA_EXT_DABT_ERROR
 #define RTA_EXT_DABT_ERROR             0
#endif


/*==============================================================================
   Checks for valid RTA and retargetting configurations
==============================================================================*/

/* If RTA Terminal is defined, Retargetting must also be defined */
#if ((__RTA_ENABLED) && (__RTA_TERM_SUPPORT)) 
  #if (__IO_RETARGET_ENABLED == 0)
    #error Real-Time Agent Terminal Support is enabled, but I/O Retargetting is not. I/O Retargetting is required to support the Real-Time Agent Terminal. Enable I/O Retargetting or disable Real-Time Agent Terminal support.
  #endif
#endif

/* If STDIO route is to RTA, then both RTA and RTA Terminal must be defined */
#if ((__IO_RETARGET_ENABLED) && (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_RTA))
  #if ((__RTA_ENABLED == 0) || ((__RTA_ENABLED == 1) && (__RTA_TERM_SUPPORT == 0)))  
    #error STDIO is redirected to the Real-Time Agent Terminal, but Real-Time Agent Terminal Support is not enabled. Enable Real-Time Agent Terminal support, or redirect STDIO elsewhere.
  #endif
#endif


/*==============================================================================
   RTA Hardware Specific Section 
==============================================================================*/

#if ((__RTA_HW_TYPE == RTA_HW_LPC21xx) || (__RTA_HW_TYPE == RTA_HW_LPC22xx)) 

#include <LPC21xx.H>                /* LPC21xx definitions  */

#define RTA_EXPORT_IRQS   0

#define TX_IRQ_INIT()     VICVectAddr13 = (unsigned long)RTA_tx_word; \
                          VICVectCntl13 = 0x20 | 3;                      
#define TX_IRQ_ACK()      VICVectAddr = 0;
#define TX_IRQ_ENABLE()   VICIntEnable = 0x00000008;
#define TX_IRQ_DISABLE()  VICIntEnClr = 0x00000008;
                                            
#define RX_IRQ_INIT()     VICVectAddr14 = (unsigned long)RTA_rx_word; \
                          VICVectCntl14 = 0x20 | 2;               
#define RX_IRQ_ACK()      VICVectAddr = 0; 
#define RX_IRQ_ENABLE()   VICIntEnable = 0x00000004;
#define RX_IRQ_DISABLE()  VICIntEnClr = 0x00000004;

#define DEF_IRQ_INIT()    VICDefVectAddr= (unsigned long)RTA_def_irq;
#define DEF_IRQ_ACK()     VICVectAddr = 0;

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }
 

#elif (__RTA_HW_TYPE == RTA_HW_LPC23xx) 

#include <LPC23xx.H>                /* LPC23xx definitions  */

#define RTA_EXPORT_IRQS   0

#define TX_IRQ_INIT()     VICVectAddr3 = (unsigned long)RTA_tx_word; \
                          VICVectCntl3 = 0x0f;                      
#define TX_IRQ_ACK()      VICVectAddr = 0;
#define TX_IRQ_ENABLE()   VICIntEnable = 0x00000008;
#define TX_IRQ_DISABLE()  VICIntEnClr = 0x00000008;
                                            
#define RX_IRQ_INIT()     VICVectAddr2 = (unsigned long)RTA_rx_word; \
                          VICVectCntl2 = 0x0f;               
#define RX_IRQ_ACK()      VICVectAddr = 0; 
#define RX_IRQ_ENABLE()   VICIntEnable = 0x00000004;
#define RX_IRQ_DISABLE()  VICIntEnClr = 0x00000004;

#define DEF_IRQ_INIT()    
#define DEF_IRQ_ACK()     

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }
 
 
#elif (__RTA_HW_TYPE == RTA_HW_STR91x)

