vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/INC/RT_Agent.c
#include <91x_lib.h> 		    /* STR91x definitions        */ 

#define RTA_EXPORT_IRQS   0

#define TX_IRQ_INIT()     VIC0->VAiR[3] = (unsigned int)RTA_tx_word; \
                          VIC0->INTSR  &= ~(0x01 << (ARMTX_ITLine)); \
                          VIC0->VCiR[3] =    0x20 | (ARMTX_ITLine); 
#define TX_IRQ_ACK()      VIC0->VAR = 0; \
                          VIC1->VAR = 0;
#define TX_IRQ_ENABLE()   VIC0->INTER  |=  (0x01 << (ARMTX_ITLine));
#define TX_IRQ_DISABLE()  VIC0->INTECR |=  (0x01 << (ARMTX_ITLine));
                                                            
#define RX_IRQ_INIT()     VIC0->VAiR[2] = (unsigned int)RTA_rx_word; \
                          VIC0->INTSR  &= ~(0x01 << (ARMRX_ITLine)); \
                          VIC0->VCiR[2] =    0x20 | (ARMRX_ITLine);                         
#define RX_IRQ_ACK()      VIC0->VAR = 0; \
                          VIC1->VAR = 0;
#define RX_IRQ_ENABLE()   VIC0->INTER  |=  (0x01 << (ARMRX_ITLine));
#define RX_IRQ_DISABLE()  VIC0->INTECR |=  (0x01 << (ARMRX_ITLine));

#define DEF_IRQ_INIT()    VIC0->DVAR    = (unsigned long)RTA_def_irq;
#define DEF_IRQ_ACK()     VIC0->VAR = 0; \
                          VIC1->VAR = 0;

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }


#elif (__RTA_HW_TYPE == RTA_HW_AT91SAM7Sx)

#include <AT91SAM7S64.H>  	    /* AT91SAM7Sx definitions        */ 

#define RTA_EXPORT_IRQS   1      

#define TX_IRQ_INIT()     // In user code
#define TX_IRQ_ACK()      // In user code
#define TX_IRQ_ENABLE()   *AT91C_DBGU_IER = AT91C_US_COMM_TX;   
#define TX_IRQ_DISABLE()  *AT91C_DBGU_IDR = AT91C_US_COMM_TX;
           
#define RX_IRQ_INIT()     // In user code          
#define RX_IRQ_ACK()      // In user code          						   
#define RX_IRQ_ENABLE()   *AT91C_DBGU_IER = AT91C_US_COMM_RX;
#define RX_IRQ_DISABLE()  *AT91C_DBGU_IDR = AT91C_US_COMM_RX;
       
#define DEF_IRQ_INIT()    *AT91C_AIC_SPU = (unsigned long) RTA_def_irq;
#define DEF_IRQ_ACK()     *AT91C_AIC_EOICR = 0;

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }


#elif (__RTA_HW_TYPE == RTA_HW_AT91SAM7Xx)

#include <AT91SAM7X256.H>       /* AT91SAM7Xx definitions          */

#define RTA_EXPORT_IRQS   1      

#define TX_IRQ_INIT()     // In user code
#define TX_IRQ_ACK()      // In user code
#define TX_IRQ_ENABLE()   *AT91C_DBGU_IER = AT91C_US_COMM_TX;   
#define TX_IRQ_DISABLE()  *AT91C_DBGU_IDR = AT91C_US_COMM_TX;
           
#define RX_IRQ_INIT()     // In user code          
#define RX_IRQ_ACK()      // In user code          						   
#define RX_IRQ_ENABLE()   *AT91C_DBGU_IER = AT91C_US_COMM_RX;
#define RX_IRQ_DISABLE()  *AT91C_DBGU_IDR = AT91C_US_COMM_RX;
       
#define DEF_IRQ_INIT()    *AT91C_AIC_SPU = (unsigned long) RTA_def_irq;
#define DEF_IRQ_ACK()     *AT91C_AIC_EOICR = 0;

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }


#elif (__RTA_HW_TYPE == RTA_HW_AT91SAM9261)

#include <AT91SAM9261.H>        /* AT91SAM9261 definitions          */

#define RTA_EXPORT_IRQS   1      

#define TX_IRQ_INIT()     // In user code
#define TX_IRQ_ACK()      // In user code
#define TX_IRQ_ENABLE()   *AT91C_DBGU_IER = AT91C_US_COMM_TX;   
#define TX_IRQ_DISABLE()  *AT91C_DBGU_IDR = AT91C_US_COMM_TX;
           
#define RX_IRQ_INIT()     // In user code          
#define RX_IRQ_ACK()      // In user code          						   
#define RX_IRQ_ENABLE()   *AT91C_DBGU_IER = AT91C_US_COMM_RX;
#define RX_IRQ_DISABLE()  *AT91C_DBGU_IDR = AT91C_US_COMM_RX;
       
#define DEF_IRQ_INIT()    *AT91C_AIC_SPU = (unsigned long) RTA_def_irq;
#define DEF_IRQ_ACK()     *AT91C_AIC_EOICR = 0;

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }


#elif (__RTA_HW_TYPE == RTA_HW_AT91SAM9263)

#include <AT91SAM9263.H>        /* AT91SAM9263 definitions          */

#define RTA_EXPORT_IRQS   1      

#define TX_IRQ_INIT()     // In user code
#define TX_IRQ_ACK()      // In user code
#define TX_IRQ_ENABLE()   *AT91C_DBGU_IER = AT91C_US_COMM_TX;   
#define TX_IRQ_DISABLE()  *AT91C_DBGU_IDR = AT91C_US_COMM_TX;
           
#define RX_IRQ_INIT()     // In user code          
#define RX_IRQ_ACK()      // In user code          						   
#define RX_IRQ_ENABLE()   *AT91C_DBGU_IER = AT91C_US_COMM_RX;
#define RX_IRQ_DISABLE()  *AT91C_DBGU_IDR = AT91C_US_COMM_RX;
       
#define DEF_IRQ_INIT()    *AT91C_AIC_SPU = (unsigned long) RTA_def_irq;
#define DEF_IRQ_ACK()     *AT91C_AIC_EOICR = 0;

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }

#elif (__RTA_HW_TYPE == RTA_HW_POLLED)

#define RTA_EXPORT_IRQS   1      

#define TX_IRQ_INIT()     // Not used in polled mode
#define TX_IRQ_ACK()      // Not used in polled mode
#define TX_IRQ_ENABLE()   RTA_irq_enable_ext()      // Implemented by user
#define TX_IRQ_DISABLE()  RTA_irq_disable_ext()     // Implemented by user
           
#define RX_IRQ_INIT()     // Not used in polled mode
#define RX_IRQ_ACK()      // Not used in polled mode
#define RX_IRQ_ENABLE()   // Not used in polled mode
#define RX_IRQ_DISABLE()  // Not used in polled mode
       
#define DEF_IRQ_INIT()    // In user code
#define DEF_IRQ_ACK()     // In user code

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }

#define TX_WORD_POSS      __asm { MRC     p14,0,r,c0,c0   } \
                          __asm { AND     r,r,#0x02       } \
                          __asm { EOR     r,r,#0x02       }
#define RX_WORD_POSS      __asm { MRC     p14,0,r,c0,c0   } \
                          __asm { AND     r,r,#0x01       }


#elif (__RTA_HW_TYPE == RTA_HW_CUSTOM)  /* Custom hardare */

