vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/INC/RT_Agent.c
#define RTA_EXPORT_IRQS   0

#define TX_IRQ_INIT()     // User to implement  
#define TX_IRQ_ACK()      // User to implement
#define TX_IRQ_ENABLE()   // User to implement
#define TX_IRQ_DISABLE()  // User to implement                                                             

#define RX_IRQ_INIT()     // User to implement          
#define RX_IRQ_ACK()      // User to implement
#define RX_IRQ_ENABLE()   // User to implement
#define RX_IRQ_DISABLE()  // User to implement

#define DEF_IRQ_INIT()    // User to implement
#define DEF_IRQ_ACK()     // User to implement

#define TX_WORD()         __asm { MCR     p14, 0, tx_word, c1, c0 }      
#define RX_WORD()         __asm { MRC     p14, 0, rx_word, c1, c0 }

#endif  /* __RTA_HW_TYPE */


/*==============================================================================
   Helper MACROs
==============================================================================*/

// IO Retargetting is redirected to a useful location
#define __IO_RETARGET_STDIO_IN_USE  ((__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_COM_1) || (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_RTA))


/*==============================================================================
   Real-Time Agent Definitions
==============================================================================*/

#if (__RTA_TERM_SUPPORT)
  #include <stdio.h>
#endif

// Protocol Constants
#define RTA_TX_MAGIC_NO      0xFA
#define RTA_INITIAL_SEQ_NO   0xCE
#define RTA_SYNC_WORD        0xFA00CE00
#define RTA_SYNC_MSG_SIZE    2
#define RTA_REQ_RSP_BIT      0x80
#define RTA_TERM_RETRY_COUNT 500
#define RTA_MAX_DATA_LEN     120          
#define RTA_MAX_MSG_LEN      (RTA_MAX_DATA_LEN + 8)  // Message = Header + Data + Checksum = 128 (32 words)

// Buffer masks
#define RTA_OUT_MASK         (__RTA_OUT_SIZE-1ul)
#define RTA_TERM_IN_MASK     (__RTA_TERM_IN_SIZE-1ul)

// Internal Status flags
#define FLAG_DABT_PROTECT    1

// Functional macros
#define RTA_RESET()          {unsigned int iZero = 0;                          \
                              RTA_Msg(RTA_CMD_UNKNOWN, &iZero, RTA_SHORT_MSG); \
                              rta.status &= ~RTA_STATUS_CONNECTED;}                                         // Reset RTA communications
                             
#define RTA_SYNC()           RTA_Msg(RTA_CMD_SYNC, (unsigned int *)&sync_msg_data, RTA_SYNC_MSG_SIZE);      // Sync  RTA communications
                             
#define RTA_IS_INIT         (rta.status & RTA_STATUS_INTIALIZED == RTA_STATUS_INTIALIZED)                   // RTA is initialised
#define RTA_BUFFER_OVERRUN  (rta.status & RTA_STATUS_BUF_OVERRUN == RTA_STATUS_BUF_OVERRUN)                 // RTA has a buffer overrun
#define RTA_HOST_CONNECTED  (rta.status & RTA_STATUS_CONNECTED == RTA_STATUS_CONNECTED)                     // RTA host is connected

// RTA Internal (private) command definitions
typedef enum __RTA_INTERNAL_COMMANDS
{
  RTA_CMD_SYNC            = 0x00,

  /* Normal internal command codes */
  RTA_CMD_ERROR           = 0x01,
  RTA_CMD_TERM_DATA       = 0x02,
  RTA_CMD_SET_ADDRESS     = 0x03,
  RTA_CMD_MEM_WRITE_8     = 0x04,
  RTA_CMD_MEM_WRITE_16    = 0x05,
  RTA_CMD_MEM_WRITE_32    = 0x06,
  RTA_CMD_RTX_TASK_CHANGE = 0x0A,
  RTA_CMD_RTX_TASK_SWITCH = 0x0B,
  
  /* Synchronous response command codes (must have bit 7 set) */
  RTA_CMD_GET_VERSION     = 0x80,
  RTA_CMD_MEM_READ_8      = 0x81,
  RTA_CMD_MEM_READ_16     = 0x82,
  RTA_CMD_MEM_READ_32     = 0x83,
  RTA_CMD_RTX_MON_START   = 0x84,
  RTA_CMD_RTX_MON_STOP    = 0x85,
    
  /* Speical Unknown command definition for reset */
  RTA_CMD_UNKNOWN         = 0x0F     
} RTA_INTERNAL_COMMANDS;

// RTA message formats
typedef enum __MSG_FORMAT {
  MSG_FORMAT_SHORT = 0,
  MSG_FORMAT_LONG,
  MSG_FORMAT_TASKSWITCH
} MSG_FORMAT;

// RTA state machine states
typedef enum __RTA_STATES
{
  RTA_STATE_COMMAND = 0,
  RTA_STATE_ADDRESS,
  RTA_STATE_MEM_WRITE_8,
  RTA_STATE_MEM_WRITE_16,
  RTA_STATE_MEM_WRITE_32,
  RTA_STATE_COUNT                 // Always leave at end
} RTA_STATES;

// RTA message header split
typedef struct __msg_header_t {
  unsigned int length     : 8;    // 0x000000XX
  unsigned int seq_no     : 8;    // 0x0000XX00
  unsigned int type       : 8;    // 0x00XX0000
  unsigned int fixed      : 8;    // 0xXX000000
} msg_header_t;

// RTA message header union
typedef union __msg_header_u {
    msg_header_t split;
    unsigned int raw;
} msg_header_u;

// RTA message structure
typedef struct __RTA_msg_t {
  msg_header_u header;
  const unsigned int* data;
  unsigned int checksum;
} RTA_msg_t;

// RTA RX state machine function pointers typedef 
typedef void (*state_fp)(unsigned int rx_word);

// RTA output buffer
typedef struct __RTA_out_t {
  unsigned int data[__RTA_OUT_SIZE];
  unsigned int wr_idx;
  unsigned int rd_idx;
} RTA_out_t;

// RTA Terminal Emulator buffer
typedef struct __RTA_term_in_t {
  unsigned char data[__RTA_TERM_IN_SIZE];
  unsigned char wr_idx;
  unsigned char rd_idx;
} RTA_term_in_t;

// RTA structure
typedef struct __RTA_t {
  unsigned int stateMachine;      // RTA state machine state
  unsigned char tx_seq_no;        // Transmit sequence number
  unsigned int status;            // RTX status flags

  unsigned int rw_addr;           // Read/Write address
  unsigned int w_end_addr;        // Write end address

  RTA_out_t out;                  // Output buffer
} RTA_t;

/*==============================================================================
   Real-Time Agent Exported Variables
==============================================================================*/

// File pointers for the RTA terminal emulation (RTA_printf, etc)
void * __RTA_fpDbgIn = 0;
void * __RTA_fpDbgOut = 0;

// RTA Flags
// NOTE:   This variable cannot be static because it is required by __asm functions
// FORMAT: 0x0000000(0000000 | Data Abort protection flag)
volatile int __RTA_Flags = 0; 

/*==============================================================================
   Real-Time Agent Version Number variable
==============================================================================*/                 

