vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/INC/RT_Agent.c
#if (__RTA_ENABLED)
__attribute__((used)) const unsigned int __rta_version = __RTA_VERSION; // Real-Time Agent version
#else
__attribute__((used)) const unsigned int __rta_version = 0;             // Zero indicates Real-Time Agent compiled out
#endif

#if (__RTA_ENABLED)
/*==============================================================================
   RTA MAIN CODE (ENABLED CODE SECTION)
==============================================================================*/                 

// RTA variables	
static volatile RTA_t rta;                // Agent state structure
            
#if (__RTA_TERM_SUPPORT)
  static volatile RTA_term_in_t term_in;  // Terminal Emulator input buffer
#endif

// Function prototypes
static RTA_STATUS send_msg_raw (RTA_msg_t *msg, MSG_FORMAT format);
#if (RTA_EXPORT_IRQS)
void RTA_rx_word_ext (void);
void RTA_tx_word_ext (void);
#else
static __irq void RTA_rx_word (void);
static __irq void RTA_tx_word (void);
#endif
static __irq void RTA_def_irq (void);
static void main_cmd(unsigned int rx_word);
static void main_addr(unsigned int rx_word);
static void main_mem_rd_32(unsigned int rx_word);
static void main_mem_wr_8(unsigned int rx_word);
static void main_mem_wr_16(unsigned int rx_word);
static void main_mem_wr_32(unsigned int rx_word);
__asm unsigned int __RTA_rd_adr (unsigned int *addrData, unsigned int r1);
__asm void __RTA_wr_8 (unsigned int addrData, unsigned int data);
__asm void __RTA_wr_16 (unsigned int addrData, unsigned int data);
__asm void __RTA_wr_32 (unsigned int addrData, unsigned int data);


// RTA RX state machine function pointers 
static state_fp const state_funcs[RTA_STATE_COUNT] = {
                                            main_cmd,
                                            main_addr,
                                            main_mem_wr_8,
                                            main_mem_wr_16,
                                            main_mem_wr_32
                                            };

static const unsigned int sync_msg_data[RTA_SYNC_MSG_SIZE] = {0x52415365,
                                                              0x77656C6C};


/* Buffer read / write macros */

/* RTA Host out buffer */
#define OUT_BUF_RESET()     (rta.out.rd_idx = rta.out.wr_idx = 0)
#define OUT_BUF_WR(dataOut) (rta.out.data[RTA_OUT_MASK & rta.out.wr_idx++] = (dataOut))
#define OUT_BUF_RD()        (rta.out.data[RTA_OUT_MASK & rta.out.rd_idx++])   
#define OUT_BUF_EMPTY()     (rta.out.rd_idx == rta.out.wr_idx)
#define OUT_BUF_FULL()      (rta.out.rd_idx == rta.out.wr_idx+1)

/* RTA Host terminal in buffer */
#define TERM_IN_BUF_RESET()     (term_in.rd_idx = term_in.wr_idx = 0)
#define TERM_IN_BUF_WR(dataOut) (term_in.data[RTA_TERM_IN_MASK & term_in.wr_idx++] = (dataOut))
#define TERM_IN_BUF_RD()        (term_in.data[RTA_TERM_IN_MASK & term_in.rd_idx++])
#define TERM_IN_BUF_EMPTY()     (term_in.rd_idx == term_in.wr_idx)
#define TERM_IN_BUF_FULL()      (term_in.rd_idx == term_in.wr_idx+1)
#define TERM_IN_BUF_NOT_EMPTY() ((term_in.wr_idx - term_in.rd_idx) & RTA_TERM_IN_MASK)


/*==============================================================================
   RTA External Functions 
==============================================================================*/

/*
 *  Initialise Real-Time Agent
 *    Parameters:     None
 *    Return Value:   RTA_STATUS (0 = OK)
 */
RTA_STATUS RTA_Init (void) {

  if (!RTA_IS_INIT) {                  
    DEF_IRQ_INIT();                             // Set up the default (suprious) interrupt 
    TX_IRQ_INIT();                              // Set up the RTA TX interrupt 
    RX_IRQ_INIT();                              // Set up the RTA RX interrupt
                                     
    rta.stateMachine = RTA_STATE_COMMAND;       // Reset the states and buffer pointers
    rta.tx_seq_no = RTA_INITIAL_SEQ_NO;
    OUT_BUF_RESET();                            // Set buffer empty conditions
    rta.status = 0;                             // Clear status flags

#if (__RTA_TERM_SUPPORT)
    TERM_IN_BUF_RESET();                        // Reset terminal buffer    
    __RTA_fpDbgIn = fopen("RTADBGIN", "r");     // Open RTA dbg in for reading               
    __RTA_fpDbgOut = fopen("RTADBGOUT", "w");   // Open RTA dbg out for writing                           

#endif /* #if (__RTA_TERM_SUPPORT)*/

    RX_IRQ_ENABLE();                            // Enable RTA Rx Interrupt
    rta.status |= RTA_STATUS_INTIALIZED;        // Set initialised flag
  }

  return (RTA_OK);
}

/*
 *  Get the Real-Time Agent status
 *    Parameters:     None
 *    Return Value:  Real-Time Agent status flags
 */
__RTA_DEC unsigned int RTA_Status (void) {
  return (rta.status);
}

/*
 *  Send a message to the host via Real-Time Agent
 *    Parameters:     type:   type code of command/message
 *                    data:   pointer to message buffer to send
 *                    length: length of data message buffer in words,
 *                            or 0 for a short message
 *    Return Value:   RTA_STATUS (0 = OK)
 */
__RTA_DEC RTA_STATUS RTA_Msg (unsigned int type, unsigned int *data, unsigned int length) {
  RTA_STATUS status = RTA_OK;
  MSG_FORMAT format;
  RTA_msg_t  msg;

  if (RTA_IS_INIT) {
  
    // Create header
    msg.header.split.type = type;
  
    // Add data
    if (length) {                               // Long Message    
      msg.header.split.length = length;
      msg.data = data;
      format = MSG_FORMAT_LONG;
    }
    else {                                      // Short Message
      if (data == 0) return (RTA_ERR_PARAM);    // Parameter check
      msg.header.split.length = *data;
      format = MSG_FORMAT_SHORT;                // Indicates short message    
    }
        
    status = send_msg_raw(&msg, format);        // Send message

  }
  else {
    status = RTA_ERR_NOT_INIT;
  }

  return (status);
}

