vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/INC/RT_Agent.c
/*
 *  Send RTX Kernel task switch information to the host via Real-Time Agent
 *    Parameters:     tsk:    packed task switch message
 *    Return Value:   RTA_STATUS (0 = OK)
 */
__RTA_DEC void RTA_Task_Mon (unsigned int tsk) {
  RTA_msg_t  msg;

	tsk &= 0x7FFFFFFF; 
  
#ifdef __BIG_ENDIAN 
  msg.header.raw = __rev(tsk);     // If big endian, must swap to keep procotol happy (use ARM intrinsic)
#else
  msg.header.raw = tsk;            // If little endian, no need to swap
#endif
   
	send_msg_raw(&msg, MSG_FORMAT_TASKSWITCH);
}

/*==============================================================================
   RTA Receive Functions
==============================================================================*/

/*  
 *  Handle a read/write address from the host
 *    Parameters:      rx_word:   received address word
 *    Return Value:    None 
 */
static void main_addr(unsigned int rx_word) {
  rta.rw_addr = rx_word;
  rta.stateMachine = RTA_STATE_COMMAND;
}

/*
 *  Handle a mem read from the host
 *    Parameters:      length:   length of data to read in words
 *    Return Value:    None
 */
static void main_mem_rd_32(unsigned int length){
  // Return the data that was requested to read
  RTA_Msg(RTA_CMD_MEM_READ_32, 
          (unsigned int *)rta.rw_addr, 
          length);
}

/*
 *  Handle a 8-bit mem write from the host
 *    Parameters:      data:   data to write
 *    Return Value:    None
 */
static void main_mem_wr_8(unsigned int data) {
  unsigned int byte = 0;

  // Write data (8-bit)
  __RTA_Flags |= FLAG_DABT_PROTECT;
  while ((rta.rw_addr < rta.w_end_addr) && (byte < 32)) {
    __RTA_wr_8 (rta.rw_addr, (data >> byte));
    rta.rw_addr += sizeof(unsigned char);
    byte+=8;
  }
  __RTA_Flags &= ~(FLAG_DABT_PROTECT);

  // Switch back to command mode when write finished
  if (rta.rw_addr >= rta.w_end_addr) {
    rta.stateMachine = RTA_STATE_COMMAND;  
  }
}

/*
 *  Handle a 16-bit mem write from the host
 *    Parameters:      data:   data to write
 *    Return Value:    None
 */
static void main_mem_wr_16(unsigned int data) {
  unsigned int halfword = 0;

  // Write data (16-bit)
  __RTA_Flags |= FLAG_DABT_PROTECT;
  while ((rta.rw_addr < rta.w_end_addr) && (halfword < 32)) {
    __RTA_wr_16 (rta.rw_addr, (data >> halfword));
    rta.rw_addr += sizeof(unsigned short);
    halfword+=16;
  }
  __RTA_Flags &= ~(FLAG_DABT_PROTECT); 

  // Switch back to command mode when write finished
  if (rta.rw_addr >= rta.w_end_addr) {
    rta.stateMachine = RTA_STATE_COMMAND;  
  }
}

/*
 *  Handle a 32-bit mem write from the host
 *    Parameters:      data:   data to write
 *    Return Value:    None
 */
static void main_mem_wr_32(unsigned int data) {
  // Write data (32-bit)
  __RTA_Flags |= FLAG_DABT_PROTECT;
  __RTA_wr_32 (rta.rw_addr, data);
  rta.rw_addr += sizeof(unsigned int);
  __RTA_Flags &= ~(FLAG_DABT_PROTECT);

  // Switch back to command mode when write finished
  if (rta.rw_addr >= rta.w_end_addr) {
    rta.stateMachine = RTA_STATE_COMMAND;  
  }
}

/*
 *  Handle commands from the host
 *    Parameters:      rx_word:   command word received
 *                     val:   Data
 *    Return Value:    None
 */
static void main_cmd(unsigned int rx_word) {

  /* Could check sequence number and magic number here, but
     do not because of the processing time cost */
  switch ((rx_word >> 16) & 0xFF) {                    // Message type
    case RTA_CMD_SYNC:
      if (rx_word == RTA_SYNC_WORD) {
        RTA_SYNC();
      }
      else {
        RTA_RESET();
      } 
    break;

    case RTA_CMD_GET_VERSION:
      rta.status |= RTA_STATUS_CONNECTED;
      RTA_Msg(RTA_CMD_GET_VERSION, (unsigned int *)&__rta_version, RTA_SHORT_MSG);
    break;

    case RTA_CMD_TERM_DATA:
#if (__RTA_TERM_SUPPORT)
      // Pass term data to term in buffer
      TERM_IN_BUF_WR(rx_word & 0x000000FF);
#endif
    break;

    case RTA_CMD_SET_ADDRESS:
      rta.stateMachine = RTA_STATE_ADDRESS;
    break;

    case RTA_CMD_MEM_READ_32:                
      main_mem_rd_32(rx_word & 0x000000FF);
    break;  

    /* RTX monitoring messages */
#if 0   // Not implemented
    case RTA_CMD_RTX_MON_START:
      rta.rtx_mon = 1;
    break;

    case RTA_CMD_RTX_MON_STOP:
      rta.rtx_mon = 0;
    break;
#endif

    /* Special mode messages */
    case RTA_CMD_MEM_WRITE_8:
      rta.w_end_addr = rta.rw_addr + ((rx_word & 0x000000FF)); 
      rta.stateMachine = RTA_STATE_MEM_WRITE_8;                
    break;

    case RTA_CMD_MEM_WRITE_16:
      rta.w_end_addr = rta.rw_addr + ((rx_word & 0x000000FF) << 1); 
      rta.stateMachine = RTA_STATE_MEM_WRITE_16;                
    break;

    case RTA_CMD_MEM_WRITE_32:
      rta.w_end_addr = rta.rw_addr + ((rx_word & 0x000000FF) << 2); 
      rta.stateMachine = RTA_STATE_MEM_WRITE_32;                
    break;

    default:
      RTA_RESET();
  }
}

/*
 *  RTA Receive word possible
 *    Parameters:      None
 *    Return Value:    0 = Not possible, Non-zero = possible
 */
#if (__RTA_HW_TYPE == RTA_HW_POLLED)
static __forceinline int RTA_rx_word_poss (void)
{
  int r;
  RX_WORD_POSS;
  return (r);
}
#endif /* if (__RTA_HW_TYPE == RTA_HW_POLLED) */

/*
 *  RTA Receive word (interrupt context)
 *    Parameters:      None
 *    Return Value:    None
 */
#if (RTA_EXPORT_IRQS)
void RTA_rx_word_ext (void)
#else
static __irq void RTA_rx_word (void)
#endif
{
  unsigned int rx_word;

  RX_IRQ_ACK();                               // Acknowledge Interrupt

#if (__RTA_HW_TYPE == RTA_HW_POLLED)
  if (RTA_rx_word_poss()) {                   // Check RX buffer free
#endif
    RX_WORD();                                // Read word from hardware                                
    state_funcs[rta.stateMachine](rx_word);   // Call state machine
#if (__RTA_HW_TYPE == RTA_HW_POLLED)
  }
#endif
}

/*==============================================================================
   RTA Transmit Functions
==============================================================================*/

