vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/INC/RT_Agent.c
/*
 *  Send a message to the host
 *    Parameters:      msg:     pointer to the message
 *                     //format:  format of the message (LONG or SHORT)
 *                     Message format is now determined by a NULL data pointer
 *    Return Value:    RTA_STATUS (0 = OK)
 */
#define   __RTA_ARM_MODE_MASK   0x1F
#define   __RTA_ARM_MODE_USER   0x10

static RTA_STATUS send_msg_raw (RTA_msg_t *msg, MSG_FORMAT format) {
  RTA_STATUS retVal = RTA_OK;
  unsigned int type = msg->header.split.type;
  const unsigned int *data = msg->data;                   // Local pointer to the data
  unsigned int length = msg->header.split.length;
  unsigned int bufLeft, bufNeeded;   
#ifdef __RTX
  register unsigned int R_cpsr __asm("cpsr"); 
  int bUserMode = ((R_cpsr & __RTA_ARM_MODE_MASK) == __RTA_ARM_MODE_USER);
#endif

  RX_IRQ_DISABLE();                                       // Disable RTA Rx Interrupt (required to stop incoming messages)
  TX_IRQ_DISABLE();                                       // Disable RTA Tx Interrupt
#ifdef __RTX
  if (bUserMode) tsk_lock();                              // Disable RTX OS Interrupt (if in user mode)
#endif

  // Special case for sync (and reset) messages
  if (format != MSG_FORMAT_TASKSWITCH) {
    if ((type == RTA_CMD_UNKNOWN) || (type == RTA_CMD_SYNC)) {   
      // Have to reset the states and buffer pointers here with TX IRQ disabled so it is safe
      rta.stateMachine = RTA_STATE_COMMAND;
      OUT_BUF_RESET();                                    // Set buffer empty condition
      rta.tx_seq_no = RTA_INITIAL_SEQ_NO;                 // Reset sequence number
    }
  }

  /* Check there is enough buffer for the message, otherwise discard it
     Note: We leave at least RTA_MAX_MSG_LEN in the buffer at all times
     for req/rsp messages from the host */
  bufNeeded = (format == MSG_FORMAT_LONG) ? length : 1;   // Message length
  if ((!(type & RTA_REQ_RSP_BIT)) || (format == MSG_FORMAT_TASKSWITCH)) {
    bufNeeded += (RTA_MAX_MSG_LEN/4);                     // Buffer reserved for req/rsp messages
    if (type == RTA_CMD_ERROR) {                          // Buffer reserved for error messages
      bufNeeded--;
    }
  }

  /* If there is no buffer free, send a buffer overrun message to host and
     discard the original message */
  bufLeft = ((rta.out.rd_idx - rta.out.wr_idx - 1) & RTA_OUT_MASK);
  if (bufLeft < bufNeeded) {                              // Buffer free    
    /* Check to see if we have already sent a buffer overrun message. If we have then
       it may still be waiting in the buffer. We cannot add another until it is sent
       otherwise we risk breaking sync. */
    retVal = RTA_ERR_BUF_OVERRUN;
    if (RTA_BUFFER_OVERRUN) {
      goto end;                                           // return
    }            
    rta.status |= RTA_STATUS_BUF_OVERRUN;

    /* Don't send errors for term data in blocking mode */
    #if __RTA_TERM_W_BLOCKING                         
      if (type != RTA_CMD_TERM_DATA) {
    #endif
      // Configure the buffer overrun message         
      msg->header.split.type = RTA_CMD_ERROR;     
      length = msg->header.split.length = RTA_ERR_BUF_OVERRUN;   
      format = MSG_FORMAT_SHORT;
    #if __RTA_TERM_W_BLOCKING
      }
      else {
        goto end;                                         // return
      }
    #endif
  } 
  else {
    rta.status &= ~RTA_STATUS_BUF_OVERRUN;
  }

  // First put the sequence number into the header
  if (format != MSG_FORMAT_TASKSWITCH) {
    msg->header.split.fixed = RTA_TX_MAGIC_NO;
    msg->header.split.seq_no = (unsigned int)rta.tx_seq_no++;
  }

  // Now write header (or short message) to the buffer
  OUT_BUF_WR(msg->header.raw);

  // Write the long message
  if (format == MSG_FORMAT_LONG) {
    __RTA_Flags |= FLAG_DABT_PROTECT;
    for (; length>0; length--) {      
      /* type reused as temp data store */
      type = __RTA_rd_adr((unsigned int *)data++, 0);
      OUT_BUF_WR(type);
    }
    __RTA_Flags &= ~FLAG_DABT_PROTECT;
  }

end:

#ifdef __RTX
  if (bUserMode) tsk_unlock();                  // Re-enable RTX OS Interrupt (if in user mode)
#endif
  TX_IRQ_ENABLE();                              // Enable RTA Tx Interrupt
  RX_IRQ_ENABLE();                              // Re-enable RTA Rx Interrupt
                                            
  return (retVal);
}


/*
 *  RTA Transmit word possible
 *    Parameters:      None
 *    Return Value:    0 = Not possible, Non-zero = possible
 */
#if (__RTA_HW_TYPE == RTA_HW_POLLED)
static __forceinline int RTA_tx_word_poss (void)
{
  int r;
  TX_WORD_POSS;
  return (r);
}
#endif /* if (__RTA_HW_TYPE == RTA_HW_POLLED) */

/*
 *  RTA Transmit word (interrupt context)
 *    Parameters:      None
 *    Return Value:    None
 */
#if (RTA_EXPORT_IRQS)
void RTA_tx_word_ext (void) {
#else
static __irq void RTA_tx_word (void) {
#endif
  unsigned int tx_word;

  TX_IRQ_ACK();                                 // Acknowledge Interrupt


  if (OUT_BUF_EMPTY()) {                        // Check for buffer empty
#if (__RTA_HW_TYPE == RTA_HW_POLLED)
  }
  else {
    if (RTA_tx_word_poss()) {                   // Check TX buffer Free
      tx_word = OUT_BUF_RD();                   // Write word to the RTA    
      TX_WORD();                                // Write word to hardware                                             
    }
  }
#else
    TX_IRQ_DISABLE();                           // Disable RTA Tx Interrupt                       
  }
  else {                                        // Write data if buffer not empty      
    tx_word = OUT_BUF_RD();                     // Write word to the RTA    
    TX_WORD();                                  // Write word to hardware                                                  
  }
#endif /* #if (__RTA_HW_TYPE == RTA_HW_POLLED) */
}


