vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/INC/RT_Agent.c
/*
 *  RTA Default Interrupt (only used when interrupts are used)
 *    Parameters:      None
 *    Return Value:    None
 */
#pragma push
#pragma diag_remark 177                 // Temporarily disable unused function warning
__RTA_DEC static __irq void RTA_def_irq (void) {
  DEF_IRQ_ACK();
}
#pragma pop  

/*==============================================================================
   RTA Terminal Emulator Functions 
==============================================================================*/

#if (__RTA_TERM_SUPPORT)

/*     
 *  Check is there is a character available in the terminal emulator buffer
 *    Parameters:      None
 *    Return Value:    Number of characters in buffer
 */
__RTA_DEC unsigned int RTA_TermIsKey (void) {
  return (TERM_IN_BUF_NOT_EMPTY());
}

/*
 *  Get a character from the terminal. This function blocks until a
 *  character is available
 *    Parameters:      None
 *    Return Value:    Character read from terminal
 */
__RTA_DEC unsigned int RTA_TermGetChar (void) {
  int ch;

  while (TERM_IN_BUF_EMPTY());              // Block waiting for character

  ch = TERM_IN_BUF_RD();                    // Read char from buffer

#if (__RTA_TERM_ECHO)
  RTA_TermPutChar(ch);                      // Echo the character back to the serial window
#endif
   
  return (ch);
}

/*
 *  Write a character to the terminal
 *    Parameters:      ch:    Character to write to the terminal
 *    Return Value:    Character written to the terminal
 */
__RTA_DEC unsigned int RTA_TermPutChar (unsigned int ch) {

#if (__RTA_TERM_W_BLOCKING)
  RTA_STATUS status;
  int iRetryCount = RTA_TERM_RETRY_COUNT;

  do {
    status = RTA_Msg(RTA_CMD_TERM_DATA, &ch, RTA_SHORT_MSG);
  } while ((status == RTA_ERR_BUF_OVERRUN) && RTA_HOST_CONNECTED && (--iRetryCount > 0));
#else
  RTA_Msg(RTA_CMD_TERM_DATA, &ch, RTA_SHORT_MSG);
#endif

  return (ch);
}

#endif /* #if (__RTA_TERM_SUPPORT) */

#else /* #if (__RTA_ENABLED) */
/*==============================================================================
   RTA MAIN CODE (DISABLED)
==============================================================================*/                 

RTA_STATUS RTA_Init (void) {
  return (RTA_ERR_DISABLED);
}

#endif /* #if (__RTA_ENABLED) */



/*==============================================================================
   Assembler Routines (ARM code)
==============================================================================*/

#pragma arm


#if (__RTA_ENABLED)
/*
 *  Read memory for the data out buffer. This must be a
 *  function call as it needs to be written in 
 *  ASM so that register locations are predicatable
 *  for the Data Abort handler as is may cause a data abort
 *    Parameters:      addrData:   address to read
 *    Return Value:    Data read
 */
__asm unsigned int __RTA_rd_adr (unsigned int *addrData, unsigned int r1) {
        LDR     R0,[R0,#0]                  ; Load the data at addrData (possible data abort)
        BX      LR                          ; Return
}

/*
 *  Write memory (8, 16 or 32 bits). This must be a
 *  function call as it needs to be written in 
 *  ASM so that register locations are predicatable
 *  for the Data Abort handler as is may cause a data abort
 *    Parameters:      addrData:   address to read
 *    Return Value:    Data read
 */
__asm void __RTA_wr_8 (unsigned int addrData, unsigned int data) {
        STRB    R1,[R0,#0]                  ; Store the data at addrData (possible data abort)
        BX      LR                          ; Return
}

__asm void __RTA_wr_16 (unsigned int addrData, unsigned int data) {
        STRH    R1,[R0,#0]                  ; Store the data at addrData (possible data abort)
        BX      LR                          ; Return
}

__asm void __RTA_wr_32 (unsigned int addrData, unsigned int data) {
        STR     R1,[R0,#0]                  ; Store the data at addrData (possible data abort)
        BX      LR                          ; Return
}
#endif /* #if (__RTA_ENABLED) */

/*
 *  DAbt_Error()
 *
 *  If this function executes it indicates that a
 *  data abort has occurred. This function can be 
 *  overriden by defining RTA_EXT_DABT_ERROR = 1
 *  and writing your own DAbt_Error() function to
 *  handle this error. DAbt_Handler must not be
 *  overridden directly as it is required by the
 *  Real-Time Agent
 */
#if (RTA_EXT_DABT_ERROR)

extern __asm void DAbt_Error (void);

#else

__asm void DAbt_Error (void) { 
        B      DAbt_Error                   ; Endless loop - Data Abort error occurred
}     

#endif

/*
 *  DAbt_Handler()
 *
 *  This function handles expected data aborts that
 *  occur during normal operation of the Real-Time
 *  Agent. To handle the Data Aborts in user code,
 *  override the DAbt_Error() function above
 *  R0 and R1 will be available to this function
 *  if the abort occurred in __RTA_rd_adr()
 */
__asm unsigned int DAbt_Handler (void) {
  #if (RTA_EXT_DABT_ERROR)
        IMPORT  DAbt_Error                  ; Import the DAbt_Error() address
  #endif
        IMPORT  __RTA_Flags                 ; Import the __RTA_Flags variable
        LDR     R1,=__RTA_Flags             ; Load the __RTA_Flags address
        LDR     R0,[R1]                     ; Load the __RTA_Flags variable
        ANDS    R1,R0,#FLAG_DABT_PROTECT    ; Check the FLAG_DABT_PROTECT flag
        BEQ     DAbt_Error                  ; Branch to the DAbt_Error if ~FLAG_DABT_PROTECT
        LDR     R0,=__RTA_NO_MEM_FLAG       ; Move No_Mem_Flag into R0
        SUBS    PC,LR,#4                    ; Return past the data abort instruction        
}






















/*==============================================================================
   I/O Retargetting Code
==============================================================================*/

