vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/RV31/INC/RT_Agent.c
// Serial routines
extern int sendchar (int ch);
extern int getkey (void);

#if (__IO_RETARGET_ENABLED)

#include <stdio.h>
#include <string.h>
#include <rt_misc.h>
#include <rt_sys.h>

#pragma import(__use_no_semihosting_swi)

/* Standard IO device handles - arbitrary, but any real filesystem handles must be
   less than 0x8000. */
#define STDIN     0x8001
#define STDOUT    0x8002
#define STDERR    0x8003
#define RTADBGIN  0x8004
#define RTADBGOUT 0x8005

struct __FILE { 
  int handle; 
};

/*--------------------------- _ttywrch --------------------------------------*/

void _ttywrch (int ch) {
  RTA_TermPutChar (ch);
}


#ifdef __MICROLIB             // MicroLIB only has stdio stream, no other file IO

int fputc(int ch, FILE *f) {
  int retVal;
  #if (__IO_RETARGET_STDIO_IN_USE)        
    #if (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_COM_1)
      retVal = sendchar(ch);
    #elif (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_RTA)
      retVal = RTA_TermPutChar(ch);
    #endif
  #else /* #if (__IO_RETARGET_STDIO_IN_USE) */
    retVal = ch;        // If STDIO sent to nowhere, just return 'ch'
  #endif  
  return (retVal);
}

int fgetc (FILE *f) {
  int retVal;
  #if (__IO_RETARGET_STDIO_IN_USE)        
    #if (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_COM_1)
      retVal = getkey();
    #elif (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_RTA)
      retVal = RTA_TermGetChar();
    #endif
  #else /* #if (__IO_RETARGET_STDIO_IN_USE) */
    retVal = (-1);      // If STDIO sent to nowhere, just return '-1'
  #endif
  return (retVal);
}

int __backspace(FILE *f) {
  return (0);
}

#else /* #ifdef __MICROLIB */ 

/* Standard IO device name defines. */
const char __stdin_name[]  = "STDIN";
const char __stdout_name[] = "STDOUT";
const char __stderr_name[] = "STDERR";

#if (__IO_RETARGET_FOPEN_ETC_ENABLED)
  #include <file_config.h>    // Header file containing definitions for... 
  /* __fopen, __fclose, __write, __flushbuf, __read, __setfpos, __get_flen */
#endif

/*--------------------------- _sys_open -------------------------------------*/

FILEHANDLE _sys_open (const char *name, int openmode) {
  /* Register standard Input Output devices. */
  if (strcmp(name, "STDIN") == 0) {
    return (STDIN);
  }
  if (strcmp(name, "STDOUT") == 0) {
    return (STDOUT);     
  }
  if (strcmp(name, "STDERR") == 0) {      
    return (STDERR);
  }
  
  /* Register Real-Time Agent debug */
  if (strcmp(name, "RTADBGIN") == 0) {
    return (RTADBGIN);
  }
  if (strcmp(name, "RTADBGOUT") == 0) {
    return (RTADBGOUT);
  }

  #if (__IO_RETARGET_FOPEN_ETC_ENABLED)
    return (__fopen (name, openmode));
  #else
    return (0);
  #endif
}

/*--------------------------- _sys_close ------------------------------------*/

int _sys_close (FILEHANDLE fh) {
  if (fh > 0x8000) {
    return (0);
  }
  #if (__IO_RETARGET_FOPEN_ETC_ENABLED)
    return (__fclose (fh));
  #else
    return (0);
  #endif
}

/*--------------------------- _sys_write ------------------------------------*/

int _sys_write (FILEHANDLE fh, const unsigned char *buf, unsigned len, int mode) {  
  int retVal = (-1);

  switch (fh) {
    case STDOUT:
    case STDERR:
      #if (__IO_RETARGET_STDIO_IN_USE)        
        #if (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_COM_1)
          for (  ; len; len--) {
            sendchar(*buf++);
          }
          retVal = 0;
        #elif (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_RTA)
          for (  ; len; len--) {
            RTA_TermPutChar(*buf++);
          }
          retVal = 0;
        #endif
      #else /* #if (__IO_RETARGET_STDIO_IN_USE) */
        retVal = 0;         // If STDIO sent to nowhere, just return OK
      #endif
    break;

    case RTADBGOUT:
      for (  ; len; len--) {
        RTA_TermPutChar(*buf++);
      }
      retVal = 0;
    break;

    default:
      #if (__IO_RETARGET_FOPEN_ETC_ENABLED)
        retVal = __write(fh, buf, len);
      #endif
  }

  return (retVal);
}

/*--------------------------- _sys_read -------------------------------------*/

int _sys_read (FILEHANDLE fh, unsigned char *buf, unsigned len, int mode) {
  int retVal = (-1);

  switch (fh) {
    case STDIN:
      /* only read one byte at a time */
      #if (__IO_RETARGET_STDIO_IN_USE)        
        #if (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_COM_1)
          if (len) {
            *buf++ = getkey();
          }
          retVal = (len-1);
        #elif (__IO_RETARGET_STDIO_ROUTE == __IO_RETARGET_STREAM_RTA)
          if (len) {
            *buf++ = RTA_TermGetChar();
          }
          retVal = (len-1);
        #endif
      #else /* #if (__IO_RETARGET_STDIO_IN_USE) */
        retVal = 0;         // If STDIO sent to nowhere, just return OK
      #endif
    break;

    case RTADBGIN:
      /* only read one byte at a time */
      if (len) {
        *buf++ = RTA_TermGetChar();
      }   
      retVal = (len-1);
    break;

    default:
      #if (__IO_RETARGET_FOPEN_ETC_ENABLED)
        retVal = __read(fh, buf, len);
      #endif
  }

  return (retVal);
}

/*--------------------------- _sys_istty ------------------------------------*/

int _sys_istty (FILEHANDLE fh) {
  if (fh > 0x8000) {
    return (1);
  }
  return (0);
}

/*--------------------------- _sys_seek -------------------------------------*/

int _sys_seek (FILEHANDLE fh, long pos) {
  if (fh > 0x8000) {
    return (0);
  }
  
  #if (__IO_RETARGET_FOPEN_ETC_ENABLED)
    return (__setfpos (fh, pos));
  #else
    return (-1);
  #endif
}

/*--------------------------- _sys_ensure -----------------------------------*/

int _sys_ensure (FILEHANDLE fh) {
  if (fh > 0x8000) {
    return (-1);
  }

  #if (__IO_RETARGET_FOPEN_ETC_ENABLED)
    return (__flushbuf (fh));
  #else
    return (-1);
  #endif
}

/*--------------------------- _sys_flen -------------------------------------*/

long _sys_flen (FILEHANDLE fh) {
  if (fh > 0x8000) {
    return (0);
  }

  #if (__IO_RETARGET_FOPEN_ETC_ENABLED)
    return (__get_flen (fh));
  #else
    return (0);
  #endif
}

/*--------------------------- _sys_tmpnam -----------------------------------*/

int _sys_tmpnam (char *name, int sig, unsigned maxlen) {
  return (1);
}

/*--------------------------- _sys_command_string ---------------------------*/

char *_sys_command_string (char *cmd, int len) {
  return (cmd);
}


#endif /* #ifdef __MICROLIB */

/*--------------------------- _sys_exit -------------------------------------*/

void _sys_exit (int return_code) {
  /* Endless loop. */
  while (1);
}

#endif /* #if (__IO_RETARGET_ENABLED) */




